Merge remote-tracking branch 'origin/feat-path-chart-uses-watch' into feat-path-chart-uses-watch
